GopalSaraf/Practicals/PSDL/include/proc/pic16c782.inc
// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0096h
// bitfield definitions
IOCB_IOCB0_POSN                          equ 0000h
IOCB_IOCB0_POSITION                      equ 0000h
IOCB_IOCB0_SIZE                          equ 0001h
IOCB_IOCB0_LENGTH                        equ 0001h
IOCB_IOCB0_MASK                          equ 0001h
IOCB_IOCB1_POSN                          equ 0001h
IOCB_IOCB1_POSITION                      equ 0001h
IOCB_IOCB1_SIZE                          equ 0001h
IOCB_IOCB1_LENGTH                        equ 0001h
IOCB_IOCB1_MASK                          equ 0002h
IOCB_IOCB2_POSN                          equ 0002h
IOCB_IOCB2_POSITION                      equ 0002h
IOCB_IOCB2_SIZE                          equ 0001h
IOCB_IOCB2_LENGTH                        equ 0001h
IOCB_IOCB2_MASK                          equ 0004h
IOCB_IOCB3_POSN                          equ 0003h
IOCB_IOCB3_POSITION                      equ 0003h
IOCB_IOCB3_SIZE                          equ 0001h
IOCB_IOCB3_LENGTH                        equ 0001h
IOCB_IOCB3_MASK                          equ 0008h
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h

// Register: REFCON
#define REFCON REFCON
REFCON                                   equ 009Bh
// bitfield definitions
REFCON_VROE_POSN                         equ 0002h
REFCON_VROE_POSITION                     equ 0002h
REFCON_VROE_SIZE                         equ 0001h
REFCON_VROE_LENGTH                       equ 0001h
REFCON_VROE_MASK                         equ 0004h
REFCON_VREN_POSN                         equ 0003h
REFCON_VREN_POSITION                     equ 0003h
REFCON_VREN_SIZE                         equ 0001h
REFCON_VREN_LENGTH                       equ 0001h
REFCON_VREN_MASK                         equ 0008h
REFCON_VREFOE_POSN                       equ 0002h
REFCON_VREFOE_POSITION                   equ 0002h
REFCON_VREFOE_SIZE                       equ 0001h
REFCON_VREFOE_LENGTH                     equ 0001h
REFCON_VREFOE_MASK                       equ 0004h
REFCON_VREFEN_POSN                       equ 0003h
REFCON_VREFEN_POSITION                   equ 0003h
REFCON_VREFEN_SIZE                       equ 0001h
REFCON_VREFEN_LENGTH                     equ 0001h
REFCON_VREFEN_MASK                       equ 0008h

// Register: LVDCON
#define LVDCON LVDCON
LVDCON                                   equ 009Ch
// bitfield definitions
LVDCON_LV_POSN                           equ 0000h
LVDCON_LV_POSITION                       equ 0000h
LVDCON_LV_SIZE                           equ 0004h
LVDCON_LV_LENGTH                         equ 0004h
LVDCON_LV_MASK                           equ 000Fh
LVDCON_LVDEN_POSN                        equ 0004h
LVDCON_LVDEN_POSITION                    equ 0004h
LVDCON_LVDEN_SIZE                        equ 0001h
LVDCON_LVDEN_LENGTH                      equ 0001h
LVDCON_LVDEN_MASK                        equ 0010h
LVDCON_BGST_POSN                         equ 0005h
LVDCON_BGST_POSITION                     equ 0005h
LVDCON_BGST_SIZE                         equ 0001h
LVDCON_BGST_LENGTH                       equ 0001h
LVDCON_BGST_MASK                         equ 0020h
LVDCON_LV0_POSN                          equ 0000h
LVDCON_LV0_POSITION                      equ 0000h
LVDCON_LV0_SIZE                          equ 0001h
LVDCON_LV0_LENGTH                        equ 0001h
LVDCON_LV0_MASK                          equ 0001h
LVDCON_LV1_POSN                          equ 0001h
LVDCON_LV1_POSITION                      equ 0001h
LVDCON_LV1_SIZE                          equ 0001h
LVDCON_LV1_LENGTH                        equ 0001h
LVDCON_LV1_MASK                          equ 0002h
LVDCON_LV2_POSN                          equ 0002h
LVDCON_LV2_POSITION                      equ 0002h
LVDCON_LV2_SIZE                          equ 0001h
LVDCON_LV2_LENGTH                        equ 0001h
LVDCON_LV2_MASK                          equ 0004h
LVDCON_LV3_POSN                          equ 0003h
LVDCON_LV3_POSITION                      equ 0003h
LVDCON_LV3_SIZE                          equ 0001h
LVDCON_LV3_LENGTH                        equ 0001h
LVDCON_LV3_MASK                          equ 0008h

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 009Dh
// bitfield definitions
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS2_POSN                          equ 0002h
ANSEL_ANS2_POSITION                      equ 0002h
ANSEL_ANS2_SIZE                          equ 0001h
ANSEL_ANS2_LENGTH                        equ 0001h
ANSEL_ANS2_MASK                          equ 0004h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ANS4_POSN                          equ 0004h
ANSEL_ANS4_POSITION                      equ 0004h
ANSEL_ANS4_SIZE                          equ 0001h
ANSEL_ANS4_LENGTH                        equ 0001h
ANSEL_ANS4_MASK                          equ 0010h
ANSEL_ANS5_POSN                          equ 0005h
ANSEL_ANS5_POSITION                      equ 0005h
ANSEL_ANS5_SIZE                          equ 0001h
ANSEL_ANS5_LENGTH                        equ 0001h
ANSEL_ANS5_MASK                          equ 0020h
ANSEL_ANS6_POSN                          equ 0006h
ANSEL_ANS6_POSITION                      equ 0006h
ANSEL_ANS6_SIZE                          equ 0001h
ANSEL_ANS6_LENGTH                        equ 0001h
ANSEL_ANS6_MASK                          equ 0040h
ANSEL_ANS7_POSN                          equ 0007h
ANSEL_ANS7_POSITION                      equ 0007h
ANSEL_ANS7_SIZE                          equ 0001h
ANSEL_ANS7_LENGTH                        equ 0001h
ANSEL_ANS7_MASK                          equ 0080h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 009Fh
// bitfield definitions
ADCON1_VCFG_POSN                         equ 0004h
ADCON1_VCFG_POSITION                     equ 0004h
ADCON1_VCFG_SIZE                         equ 0002h
ADCON1_VCFG_LENGTH                       equ 0002h
ADCON1_VCFG_MASK                         equ 0030h
ADCON1_VCFG0_POSN                        equ 0004h
ADCON1_VCFG0_POSITION                    equ 0004h
ADCON1_VCFG0_SIZE                        equ 0001h
ADCON1_VCFG0_LENGTH                      equ 0001h
ADCON1_VCFG0_MASK                        equ 0010h
ADCON1_VCFG1_POSN                        equ 0005h
ADCON1_VCFG1_POSITION                    equ 0005h
ADCON1_VCFG1_SIZE                        equ 0001h
ADCON1_VCFG1_LENGTH                      equ 0001h
ADCON1_VCFG1_MASK                        equ 0020h

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 010Ch

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 010Dh

